Revit 2027 API
ControlledApplication.ActiveAddInId Property
Retrieves the Id of the currently running external application.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AddInId ActiveAddInId { get; }
Public ReadOnly Property ActiveAddInId As AddInId
	Get
public:
property AddInId^ ActiveAddInId {
	AddInId^ get ();
}
member ActiveAddInId : AddInId with get
Property Value
AddInId
Remarks
 The application can be either a UI application, DB application, or an external command. If no addin is active, this property will return null. If an event handler is currently being executed, the returned value will be the Id of the application or command in which the event handler was registered.
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace